w20d2/tweeter_app_api/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
    def index
        tweets = Tweet.all

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "tweetone"], ["content", "contentone"], ["author", "authorone"]]
---
    def create
        tweet = Tweet.new(tweet_params)

        if tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1 WHERE "tweets"."id" = $2  [["title", "new title"], ["id", 3]]
---
    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)

DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 4]]
---
    def destroy
        tweet = Tweet.destroy(params[:id])